In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv("assets/adult.csv")

In [5]:
df.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K

In [7]:
df.isna().sum()

age                0
workclass          0
fnlwgt             0
education          0
educational-num    0
marital-status     0
occupation         0
relationship       0
race               0
gender             0
capital-gain       0
capital-loss       0
hours-per-week     0
native-country     0
income             0
dtype: int64

In [8]:
df.duplicated().sum()

52

In [10]:
df = df.drop_duplicates()

In [11]:
df.isin(['?']).sum()

age                   0
workclass          2795
fnlwgt                0
education             0
educational-num       0
marital-status        0
occupation         2805
relationship          0
race                  0
gender                0
capital-gain          0
capital-loss          0
hours-per-week        0
native-country      856
income                0
dtype: int64

In [12]:
df = df.replace('?' , np.nan)

In [13]:
df.isna().sum()

age                   0
workclass          2795
fnlwgt                0
education             0
educational-num       0
marital-status        0
occupation         2805
relationship          0
race                  0
gender                0
capital-gain          0
capital-loss          0
hours-per-week        0
native-country      856
income                0
dtype: int64

In [24]:
temp = pd.DataFrame({
    'Name' : ['Abc' , 'Pqr' , np.nan , 'Xyz'],
    'Roll No' : [1,np.nan,3,4]
})

In [25]:
temp

  Name  Roll No
0  Abc      1.0
1  Pqr      NaN
2  NaN      3.0
3  Xyz      4.0

In [26]:
# temp.dropna(axis = 0 , inplace=True)

In [27]:
temp

  Name  Roll No
0  Abc      1.0
1  Pqr      NaN
2  NaN      3.0
3  Xyz      4.0

In [34]:
temp.ffill(inplace=True)

In [35]:
temp

  Name  Roll No
0  Abc      1.0
1  Pqr      3.0
2  Xyz      3.0
3  Xyz      4.0

In [43]:
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(strategy = 'most_frequent' , missing_values = np.nan)

df['workclass'] = imputer.fit_transform(df[['workclass']]).ravel()
df['occupation'] = imputer.fit_transform(df[['occupation']]).ravel()
df['native-country'] = imputer.fit_transform(df[['native-country']]).ravel()

In [42]:
df.isna().sum()

age                   0
workclass             0
fnlwgt                0
education             0
educational-num       0
marital-status        0
occupation         2805
relationship          0
race                  0
gender                0
capital-gain          0
capital-loss          0
hours-per-week        0
native-country      856
income                0
dtype: int64

In [44]:
print(df['gender'].unique())

['Male' 'Female']

In [47]:
df['gender'] = df['gender'].replace('Male' , 1)
df['gender'] = df['gender'].replace('Female' , 0)

In [64]:
temp_df = pd.DataFrame({
    'Fruit_Name' : ['Mango' , 'Apple' , 'Banana' , 'Orange'],
    'Fruit_Price' : [899 , 199 , 59 , 89],
    'Fruit_Color' : ['Yellow' , 'Red' , 'Yellow' , 'Orange']
})

In [51]:
temp_df

  Fruit_Name  Fruit_Price Fruit_Color
0      Mango          899      Yellow
1      Apple          199         Red
2     Banana           59      Yellow
3     Orange           89      Orange

In [65]:
from sklearn.preprocessing import LabelEncoder
lbl_encoder = LabelEncoder()

In [66]:
temp_df['Fruit_Name'] = lbl_encoder.fit_transform(temp_df['Fruit_Name'])
temp_df['Fruit_Color'] = lbl_encoder.fit_transform(temp_df['Fruit_Color'])

In [67]:
temp_df

   Fruit_Name  Fruit_Price  Fruit_Color
0           2          899            2
1           0          199            1
2           1           59            2
3           3           89            0

In [68]:
temp_df = pd.get_dummies(temp_df,columns=['Fruit_Color'])

In [69]:
temp_df

   Fruit_Name  Fruit_Price  Fruit_Color_0  Fruit_Color_1  Fruit_Color_2
0           2          899          False          False           True
1           0          199          False           True          False
2           1           59          False          False           True
3           3           89           True          False          False

In [71]:
print(df['income'].unique())

['<=50K' '>50K']

In [72]:
df['income'] = df['income'].replace('<=50K' , 0)
df['income'] = df['income'].replace('>=50K' , 1)

In [73]:
print(df['marital-status'].unique())

['Never-married' 'Married-civ-spouse' 'Widowed' 'Divorced' 'Separated'
 'Married-spouse-absent' 'Married-AF-spouse']

In [74]:
df['marital-status'] = df['marital-status'].replace('Never-married' , 'Unmarried')
df['marital-status'] = df['marital-status'].replace('Married-AF-Spouse' , 'Married')
df['marital-status'] = df['marital-status'].replace('Married-civ-Spouse' , 'Married')
df['marital-status'] = df['marital-status'].replace('Married-Spouse-absent' , 'Unmarried')
df['marital-status'] = df['marital-status'].replace('Separated' , 'Unmarried')
df['marital-status'] = df['marital-status'].replace('Divorced' , 'Separated')
df['marital-status'] = df['marital-status'].replace('Widowed' , 'Widowed')

In [75]:
df['marital-status'] = lbl_encoder.fit_transform(df['marital-status'])

In [76]:
print(df['marital-status'].unique())

[4 1 5 3 2 0]

In [77]:
df['education'].unique()

array(['11th', 'HS-grad', 'Assoc-acdm', 'Some-college', '10th',
       'Prof-school', '7th-8th', 'Bachelors', 'Masters', 'Doctorate',
       '5th-6th', 'Assoc-voc', '9th', '12th', '1st-4th', 'Preschool'],
      dtype=object)